Reports/PaymentCalendar.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>PaymentCalendar</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DelayedPaymentsPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FuturePaymentsPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WorkingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/PaymentCalendar/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Procedure - "FillCheckProcessing" event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DelayedPaymentsPeriod.StartDate > WorkingDate Then
		ErrorText = NStr("en='Delayed payments period can not be more than the current date. Report generation is prohibited.'");
		CommonUseClientServer.MessageToUser(
			ErrorText,
			Undefined, // ObjectOrRef
			"DelayedPaymentsPeriod",
			"Report", // DataPath
			Cancel
		);
	EndIf;

	If FuturePaymentsPeriod.EndDate < WorkingDate Then
		ErrorText = NStr("en='Future payments period can not be less than the current date. Report generation is prohibited.'");
		CommonUseClientServer.MessageToUser(
			ErrorText,
			Undefined, // ObjectOrRef
			"FuturePaymentsPeriod",
			"Report", // DataPath
			Cancel
		);
	EndIf;
		
EndProcedure // FillCheckProcessing()

#EndIf
